jmeter_qa/test_scripts/volume/volume_csv_users_test.jmx
<?xml version='1.0' encoding='utf-8'?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5"><hashTree><TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="CSV Volume Test Plan" enabled="true"><stringProp name="TestPlan.comments" /><boolProp name="TestPlan.functional_mode">false</boolProp><boolProp name="TestPlan.serialize_threadgroups">false</boolProp><elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true" /><stringProp name="TestPlan.user_define_classpath" /></TestPlan><ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="CSV Volume Users" enabled="true"><stringProp name="ThreadGroup.num_threads">10</stringProp><stringProp name="ThreadGroup.ramp_time">2</stringProp><boolProp name="ThreadGroup.scheduler">false</boolProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true"><boolProp name="LoopController.continue_forever">false</boolProp><stringProp name="LoopController.loops">5</stringProp></elementProp></ThreadGroup><CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="User CSV Data" enabled="true"><stringProp name="filename">data/test_users.csv</stringProp><stringProp name="fileEncoding" /><stringProp name="variableNames">id,userName</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="ignoreFirstLine">true</boolProp><boolProp name="quotedData">false</boolProp><boolProp name="recycle">true</boolProp><boolProp name="stopThread">false</boolProp><stringProp name="shareMode">all</stringProp></CSVDataSet><HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /Users with CSV" enabled="true"><stringProp name="HTTPSampler.domain">fakerestapi.azurewebsites.net</stringProp><stringProp name="HTTPSampler.port" /><stringProp name="HTTPSampler.protocol">https</stringProp><stringProp name="HTTPSampler.path">/api/v1/Users</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.postBodyRaw">true</boolProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Data Payload" enabled="true"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{"id":${id},"userName":"${userName}"}</stringProp><stringProp name="Argument.metadata">=</stringProp><boolProp name="HTTPArgument.use_equals">true</boolProp><stringProp name="Argument.name" /></elementProp></collectionProp></elementProp></HTTPSamplerProxy></hashTree></jmeterTestPlan>